Patrik112358/LVDT_sensor_with_STM32/LVDT_reader/Libs/ssd1306/ssd1306.h
/**
 * This Library was originally written by Olivier Van den Eede (4ilo) in 2016.
 * Some refactoring was done and SPI support was added by Aleksander Alekseev (afiskon) in 2018.
 *
 * https://github.com/afiskon/stm32-ssd1306
 */

#ifndef __SSD1306_H__
#define __SSD1306_H__

#include <stddef.h>
#include <stdint.h>
#include <_ansi.h>
#include <stdbool.h>

_BEGIN_STD_C

#include "ssd1306_conf.h"


#if defined(STM32WB)
#  include "stm32wbxx_hal.h"
#elif defined(STM32F0)
#  include "stm32f0xx_hal.h"
#elif defined(STM32F1)
#  include "stm32f1xx_hal.h"
#elif defined(STM32F4)
#  include "stm32f4xx_hal.h"
#  include "stm32f4xx_hal_gpio.h"
#elif defined(STM32L0)
#  include "stm32l0xx_hal.h"
#elif defined(STM32L1)
#  include "stm32l1xx_hal.h"
#elif defined(STM32L4)
#  include "stm32l4xx_hal.h"
#elif defined(STM32L5)
#  include "stm32l5xx_hal.h"
#elif defined(STM32F3)
#  include "stm32f3xx_hal.h"
#elif defined(STM32H7)
#  include "stm32h7xx_hal.h"
#elif defined(STM32F7)
#  include "stm32f7xx_hal.h"
#elif defined(STM32G0)
#  include "stm32g0xx_hal.h"
#elif defined(STM32G4)
#  include "stm32g4xx_hal.h"
#elif defined(STM32C0)
#  include "stm32c0xx_hal.h"
#else
#  error                                                                                                               \
      "SSD1306 library was tested only on STM32F0, STM32F1, STM32F3, STM32F4, STM32F7, STM32L0, STM32L1, STM32L4, STM32H7, STM32G0, STM32G4, STM32WB, STM32C0 MCU families. Please modify ssd1306.h if you know what you are doing. Also please send a pull request if it turns out the library works on other MCU's as well!"
#endif


#ifdef SSD1306_X_OFFSET
#  define SSD1306_X_OFFSET_LOWER (SSD1306_X_OFFSET & 0x0F)
#  define SSD1306_X_OFFSET_UPPER ((SSD1306_X_OFFSET >> 4) & 0x07)
#else
#  define SSD1306_X_OFFSET_LOWER 0
#  define SSD1306_X_OFFSET_UPPER 0
#endif

/* vvv I2C config vvv */

#ifndef SSD1306_I2C_PORT
#  define SSD1306_I2C_PORT hi2c1
#endif

#ifndef SSD1306_I2C_ADDR
#  define SSD1306_I2C_ADDR (0x3C << 1)
#endif

/* ^^^ I2C config ^^^ */

/* vvv SPI config vvv */

#ifndef SSD1306_SPI_PORT
#  define SSD1306_SPI_PORT hspi2
#endif

#ifndef SSD1306_CS_Port
#  define SSD1306_CS_Port GPIOB
#endif
#ifndef SSD1306_CS_Pin
#  define SSD1306_CS_Pin GPIO_PIN_12
#endif

#ifndef SSD1306_DC_Port
#  define SSD1306_DC_Port GPIOB
#endif
#ifndef SSD1306_DC_Pin
#  define SSD1306_DC_Pin GPIO_PIN_14
#endif

#ifndef SSD1306_Reset_Port
#  define SSD1306_Reset_Port GPIOA
#endif
#ifndef SSD1306_Reset_Pin
#  define SSD1306_Reset_Pin GPIO_PIN_8
#endif

/* ^^^ SPI config ^^^ */

#if defined(SSD1306_USE_I2C)
extern I2C_HandleTypeDef SSD1306_I2C_PORT;
#elif defined(SSD1306_USE_SPI)
extern SPI_HandleTypeDef SSD1306_SPI_PORT;
#else
#  error "You should define SSD1306_USE_SPI or SSD1306_USE_I2C macro!"
#endif

// SSD1306 OLED height in pixels
#ifndef SSD1306_HEIGHT
#  define SSD1306_HEIGHT 64
#endif

// SSD1306 width in pixels
#ifndef SSD1306_WIDTH
#  define SSD1306_WIDTH 128
#endif

#ifndef SSD1306_BUFFER_SIZE
#  define SSD1306_BUFFER_SIZE SSD1306_WIDTH* SSD1306_HEIGHT / 8
#endif

// Enumeration for screen colors
typedef enum {
  Black = 0x00, // Black color, no pixel
  White = 0x01 // Pixel is set. Color depends on OLED
} SSD1306_COLOR;

typedef enum {
  SSD1306_OK = 0x00,
  SSD1306_ERR = 0x01 // Generic error.
} SSD1306_Error_t;

// Struct to store transformations
typedef struct {
  uint16_t CurrentX;
  uint16_t CurrentY;
  uint8_t  Initialized;
  uint8_t  DisplayOn;
} SSD1306_t;

typedef struct {
  uint8_t x;
  uint8_t y;
} SSD1306_VERTEX;

typedef struct {
  SSD1306_VERTEX top_left;
  SSD1306_VERTEX bottom_right;
} SSD1306_BOX;

typedef struct {
  SSD1306_VERTEX a;
  SSD1306_VERTEX b;
} SSD1306_LINE;
#define SSD1306_SENTINEL_LINE_INITIALIZER { { -1, -1 }, { -1, -1 } }
extern const SSD1306_LINE SSD1306_SENTINEL_LINE;

// Must be terminated with special SSD1306_SENTINEL_LINE object
typedef SSD1306_LINE SSD1306_LINE_LIST[];

/** Font */
typedef struct {
  const uint8_t         width; /**< Font width in pixels */
  const uint8_t         height; /**< Font height in pixels */
  const uint16_t* const data; /**< Pointer to font data array */
  const uint8_t* const  char_width; /**< Proportional character width in pixels (NULL for monospaced) */
} SSD1306_Font_t;


// Procedure definitions
void ssd1306_Init(void);
void ssd1306_Fill(SSD1306_COLOR color);
void ssd1306_UpdateScreen(void);
void ssd1306_DrawPixel(uint8_t x, uint8_t y, SSD1306_COLOR color);
char ssd1306_WriteChar(char ch, SSD1306_Font_t Font, SSD1306_COLOR color);
/**
 * @brief Draw 1 (partial) character to the screen buffer into (x,y)-(x+max_width,y+max_height)
 * @param ch Character to be written
 * @param top_left Top left coordinate of the text box
 * @param bottom_right Bottom right coordinate of the text box. (-1,-1) means no bounding box (screen size is the only limitation)
 * @param Font Font to be used for writing
 * @param color Color setting (Black or White)
 * @param allow_clipping Flag to enable/disable character clipping
 * @return (.x = position.x + written width, .y = position.y + written height), i.e. bottom-right outside coord of used box
 * On failure to fit character into specified box or screen with clipping disabled, returns (position.x, position.y)
 */
SSD1306_VERTEX ssd1306_WriteCharIntoBox(char ch, SSD1306_VERTEX top_left, SSD1306_VERTEX bottom_right,
    SSD1306_Font_t Font, SSD1306_COLOR color, bool allow_clipping);
char           ssd1306_WriteString(const char* str, SSD1306_Font_t Font, SSD1306_COLOR color);
char ssd1306_WriteString_AllowClipping(const char* str, SSD1306_Font_t Font, SSD1306_COLOR color, bool allow_clipping);
/**
 * @brief Writes out multiline string at the coordinates (x,y), breking on newlines,
 * allowing for partially displayed (clipped) characters
 * @param str Pointer to the string to be written
 * @param top_left Top left coordinate of the text box
 * @param bottom_right Bottom right coordinate of the text box. (-1,-1) means no bounding box (screen size is the only limitation)
 * @param Font Font to be used for writing
 * @param color Color setting (Black or White)
 * @param allow_clipping Flag to enable/disable character clipping
 * @return (.x = position.x + used width, .y = position.y + used height), i.e. bottom-right outside coord of used box
 * If clipping is disabled and the text does not fit into the box and/or screen, returns (position.x, position.y)
 */
SSD1306_VERTEX        ssd1306_WriteMultilineStringIntoBox(const char* str, SSD1306_VERTEX top_left,
           SSD1306_VERTEX bottom_right, SSD1306_Font_t Font, SSD1306_COLOR color, bool allow_clipping);
inline SSD1306_VERTEX ssd1306_WriteMultilineStringIntoBox_Box(const char* str, SSD1306_BOX bounding_box,
    SSD1306_Font_t Font, SSD1306_COLOR color, bool allow_clipping)
{
  return ssd1306_WriteMultilineStringIntoBox(str, bounding_box.top_left, bounding_box.bottom_right, Font, color,
      allow_clipping);
}
void ssd1306_SetCursor(uint8_t x, uint8_t y);
void ssd1306_Line(uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, SSD1306_COLOR color);
/**
 * @brief Draw multiple lines on the screen.
 * @param line_list List of lines to draw.
 * @param color Color of the lines.
 * @return Number of lines drawn.
 */
int  ssd1306_MultipleLines(const SSD1306_LINE_LIST line_list, SSD1306_COLOR color);
void ssd1306_DrawArc(uint8_t x, uint8_t y, uint8_t radius, uint16_t start_angle, uint16_t sweep, SSD1306_COLOR color);
void ssd1306_DrawArcWithRadiusLine(uint8_t x, uint8_t y, uint8_t radius, uint16_t start_angle, uint16_t sweep,
    SSD1306_COLOR color);
void ssd1306_DrawCircle(uint8_t par_x, uint8_t par_y, uint8_t par_r, SSD1306_COLOR color);
void ssd1306_FillCircle(uint8_t par_x, uint8_t par_y, uint8_t par_r, SSD1306_COLOR par_color);
void ssd1306_Polyline(const SSD1306_VERTEX* par_vertex, uint16_t par_size, SSD1306_COLOR color);
void ssd1306_DrawRectangle(uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, SSD1306_COLOR color);
void ssd1306_FillRectangle(uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2, SSD1306_COLOR color);

/**
 * @brief Invert color of pixels in rectangle (include border)
 * 
 * @param x1 X Coordinate of top left corner
 * @param y1 Y Coordinate of top left corner
 * @param x2 X Coordinate of bottom right corner
 * @param y2 Y Coordinate of bottom right corner
 * @return SSD1306_Error_t status
 */
SSD1306_Error_t ssd1306_InvertRectangle(uint8_t x1, uint8_t y1, uint8_t x2, uint8_t y2);
/**
 * @brief Invert color of pixels in rectangle (include border)
 * @param box Bounding box to invert
 * @return SSD1306_Error_t status
 */
inline SSD1306_Error_t ssd1306_InvertRectangle_Box(SSD1306_BOX box)
{
  return ssd1306_InvertRectangle(box.top_left.x, box.top_left.y, box.bottom_right.x, box.bottom_right.y);
}

void ssd1306_DrawBitmap(uint8_t x, uint8_t y, const unsigned char* bitmap, uint8_t w, uint8_t h, SSD1306_COLOR color);

/**
 * @brief Sets the contrast of the display.
 * @param[in] value contrast to set.
 * @note Contrast increases as the value increases.
 * @note RESET = 7Fh.
 */
void ssd1306_SetContrast(const uint8_t value);

/**
 * @brief Set Display ON/OFF.
 * @param[in] on 0 for OFF, any for ON.
 */
void ssd1306_SetDisplayOn(const uint8_t on);

/**
 * @brief Reads DisplayOn state.
 * @return  0: OFF.
 *          1: ON.
 */
uint8_t ssd1306_GetDisplayOn(void);

// Low-level procedures
void            ssd1306_Reset(void);
void            ssd1306_WriteCommand(uint8_t byte);
void            ssd1306_WriteData(uint8_t* buffer, size_t buff_size);
SSD1306_Error_t ssd1306_FillBuffer(uint8_t* buf, uint32_t len);

_END_STD_C

#endif // __SSD1306_H__
